// C++ Explicit Casting
// 1) C언어와 C++언어의 문법의 차이점
// -----------------------------------------------------------------------------------
//  C 언어 : void* => 다른 타입*의 암시적 변환 허용
//  C++ 언어 : void* => 다른 타입*의 암시적 변환 허용 안함
// -----------------------------------------------------------------------------------
// 
// 2) C 언어와 C++ 언어의 캐스팅 방법
// -----------------------------------------------------------------------------------
//  C 언어 : int* p1 = (int*)malloc(sizeof(int)*10);
//  C++ 언어 : int* p1 = static_cast<int*>(malloc(sizeof(int)*10));
// -----------------------------------------------------------------------------------

#include <iostream>
#include <cstdlib>

int main()
{
    //int* p1 = (int*)malloc(sizeof(int)*10);
    int* p1 = static_cast<int*>(malloc(sizeof(int)*10));

    free(p1);
}
